In [4]:
import numpy as np
import pandas as pd

In [5]:
label=['a','b','c']
d= {'a':10, 'b':20, 'c':30}
my_data=[10,20,30]
arr=np.array(my_data)

In [6]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [7]:
pd.Series(my_data,label)

a    10
b    20
c    30
dtype: int64

In [8]:
pd.Series(my_data)

0    10
1    20
2    30
dtype: int64

In [9]:
pd.Series(label)

0    a
1    b
2    c
dtype: object

In [10]:
ser1=pd.Series([10,2,5],['Turkey','Poland','US'])

In [11]:
ser2=pd.Series([3,6,1,10,2,5],['Venuzuella','Spain','China','Turkey','Poland','US'])

In [12]:
ser2+ser1

China          NaN
Poland         4.0
Spain          NaN
Turkey        20.0
US            10.0
Venuzuella     NaN
dtype: float64

In [13]:
def my_func():
 print('HELOO')

In [14]:
my_func()

HELOO

In [15]:
def a_func(name='Name'):
    print('Hello' +  name)

In [16]:
a_func(' Alev')

Hello Alev

In [17]:
from numpy.random import randn

In [18]:
my_df=pd.DataFrame(randn(3,3),['A','B','C'], ['X','Y','Z'])

In [19]:
my_df

          X         Y         Z
A  0.613909  0.624316 -0.810884
B  1.536015  1.306024  0.515946
C -0.382275 -2.440557 -0.601314

In [20]:
my_df[['X','Z']]

          X         Z
A  0.613909 -0.810884
B  1.536015  0.515946
C -0.382275 -0.601314

In [27]:
my_df['NEW']= my_df['X']+my_df['Y']

In [28]:
my_df

          X         Y         Z       NEW
A  0.613909  0.624316 -0.810884  1.238225
B  1.536015  1.306024  0.515946  2.842040
C -0.382275 -2.440557 -0.601314 -2.822832

In [30]:
my_df.drop('NEW',axis=1,inplace=True)

In [31]:
my_df

          X         Y         Z
A  0.613909  0.624316 -0.810884
B  1.536015  1.306024  0.515946
C -0.382275 -2.440557 -0.601314

In [33]:
my_df.shape

(3, 3)

In [34]:
my_df['X']

A    0.613909
B    1.536015
C   -0.382275
Name: X, dtype: float64

In [35]:
my_df.loc['B']

X    1.536015
Y    1.306024
Z    0.515946
Name: B, dtype: float64

In [37]:
my_df.iloc[1]

X    1.536015
Y    1.306024
Z    0.515946
Name: B, dtype: float64

In [42]:
my_df.loc['A','X']

0.6139092046274717

In [44]:
my_df.loc[['A','B'],['X','Y']]

          X         Y
A  0.613909  0.624316
B  1.536015  1.306024

In [47]:
my_df>-1

      X      Y     Z
A  True   True  True
B  True   True  True
C  True  False  True

In [52]:
my_df['X']>0

A     True
B     True
C    False
Name: X, dtype: bool

In [53]:
my_df.loc['A']>0

X     True
Y     True
Z    False
Name: A, dtype: bool

In [54]:
new_df=my_df>1

In [55]:
new_df

       X      Y      Z
A  False  False  False
B   True   True  False
C  False  False  False

In [61]:
my_df[my_df['X']>0][['X','Y','Z']]

          X         Y         Z
A  0.613909  0.624316 -0.810884
B  1.536015  1.306024  0.515946